<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"2a04b8a5187fd7704cb161426e69740f1296b0d82ea6d163741f969a6ff3451b","plan_job_ref":"Job Environment Main - Plan #383 at https://github.com/jarrod-lowe/wildsea/actions/runs/11302056308","plan_out_hash":"97f78fd2d0a258a536d078fe4bb8216417632dfee832c988adfe5212ff351e8b","plan_hash":"15615aaa7cc31e39456345bef62cd355e95b8491d922a96feebf01e3fdb262eb","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 6 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_function.function["checkGameFireflyAccess"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/checkGameFireflyAccess/checkGameFireflyAccess.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            
            // function/checkGameFireflyAccess/checkGameFireflyAccess.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.args.input.gameId;
              const key = {
                PK: DDBPrefixGame + "#" + id,
                SK: DDBPrefixGame
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              console.error(context);
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              if (!permitted(identity, context.result)) {
                util.error(
                  "Unauthorized: User does not have access to the game."
                );
              }
              return context.result;
            }
            function permitted(identity, data) {
              if (data === null) {
                return false;
              }
              console.error(data.fireflyUserId);
              console.error(identity.sub);
              if (data.fireflyUserId === identity.sub) {
                return true;
              }
              return false;
            }
            export {
              permitted,
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tHYW1lRmlyZWZseUFjY2Vzcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0svQyxJQUFNLGdCQUFnQjs7O0FEQ3RCLFNBQVMsUUFDZCxTQUN3QjtBQUN4QixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLEtBQUs7QUFDbEIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxLQUFLLFFBQVEsS0FBSyxNQUFNO0FBQzlCLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUk7QUFBQSxFQUNOO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxHQUFHO0FBQUEsRUFDcEM7QUFDRjtBQVVPLFNBQVMsU0FBUyxTQUFnRDtBQUN2RSxVQUFRLE1BQU0sT0FBTztBQUNyQixNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLE1BQUksQ0FBQyxVQUFVLFVBQVUsUUFBUSxNQUFNLEdBQUc7QUFDeEMsU0FBSztBQUFBLE1BQ0g7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUVBLFNBQU8sUUFBUTtBQUNqQjtBQUVPLFNBQVMsVUFDZCxVQUNBLE1BQ1M7QUFDVCxNQUFJLFNBQVMsTUFBTTtBQUNqQixXQUFPO0FBQUEsRUFDVDtBQUVBLFVBQVEsTUFBTSxLQUFLLGFBQWE7QUFDaEMsVUFBUSxNQUFNLFNBQVMsR0FBRztBQUMxQixNQUFJLEtBQUssa0JBQWtCLFNBQVMsS0FBSztBQUN2QyxXQUFPO0FBQUEsRUFDVDtBQUVBLFNBQU87QUFDVDsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "checkGameFireflyAccess"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["findAllPlayers"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/findAllPlayers/findAllPlayers.ts
            import {
              util
            } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/findAllPlayers/findAllPlayers.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              return {
                operation: "Query",
                query: {
                  expression: "#PK = :pk AND begins_with(#SK, :player)",
                  expressionNames: {
                    "#PK": "PK",
                    "#SK": "SK"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":pk": DDBPrefixGame + "#" + input.gameId,
                    ":player": DDBPrefixPlayer + "#"
                  })
                },
                projection: {
                  expression: "#userId",
                  expressionNames: { "#userId": "userId" }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZmluZEFsbFBsYXllcnMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQTtBQUFBLEVBQ0U7QUFBQSxPQUlLOzs7QUNBQSxJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjs7O0FERXhCLFNBQVMsUUFDZCxTQUNzQjtBQUN0QixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBZ0Q7QUFBQSxFQUM3RDtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLEtBQUs7QUFDbEIsU0FBSyxNQUFNLG1DQUFtQztBQUFBLEVBQ2hEO0FBRUEsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUdoQyxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxPQUFPO0FBQUEsTUFDTCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLE9BQU87QUFBQSxRQUNQLE9BQU87QUFBQSxNQUNUO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxPQUFPLGdCQUFnQixNQUFNLE1BQU07QUFBQSxRQUNuQyxXQUFXLGtCQUFrQjtBQUFBLE1BQy9CLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxZQUFZO0FBQUEsTUFDVixZQUFZO0FBQUEsTUFDWixpQkFBaUIsRUFBRSxXQUFXLFNBQVM7QUFBQSxJQUN6QztBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLElBQUk7QUFBQSxFQUN0RDtBQUVBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "findAllPlayers"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["updateGame"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/updateGame/updateGame.ts
            import {
              util
            } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            
            // function/updateGame/updateGame.ts
            function request(context) {
              const { gameId, name, description } = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixGame
                }),
                condition: {
                  expression: "#fireflyUserId = :fireflyUserId",
                  expressionNames: {
                    "#fireflyUserId": "fireflyUserId"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":fireflyUserId": identity.sub
                  })
                },
                update: {
                  expression: "SET #gameName = :gameName, #gameDescription = :gameDescription, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#gameName": "gameName",
                    "#gameDescription": "gameDescription",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":gameName": name,
                    ":gameDescription": description,
                    ":updatedAt": timestamp
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return {
                gameId: context.result.gameId,
                gameName: context.result.gameName,
                gameDescription: context.result.gameDescription,
                createdAt: context.result.createdAt,
                updatedAt: context.result.updatedAt,
                type: context.result.type,
                fireflyUserId: context.result.fireflyUserId
              };
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlR2FtZS50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBO0FBQUEsRUFDRTtBQUFBLE9BSUs7OztBQ0FBLElBQU0sZ0JBQWdCOzs7QURJdEIsU0FBUyxRQUNkLFNBQzJCO0FBQzNCLFFBQU0sRUFBRSxRQUFRLE1BQU0sWUFBWSxJQUFJLFFBQVEsVUFBVTtBQUN4RCxRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSTtBQUFBLElBQ04sQ0FBQztBQUFBLElBQ0QsV0FBVztBQUFBLE1BQ1QsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixrQkFBa0I7QUFBQSxNQUNwQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsa0JBQWtCLFNBQVM7QUFBQSxNQUM3QixDQUFDO0FBQUEsSUFDSDtBQUFBLElBQ0EsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixhQUFhO0FBQUEsUUFDYixvQkFBb0I7QUFBQSxRQUNwQixjQUFjO0FBQUEsTUFDaEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLGFBQWE7QUFBQSxRQUNiLG9CQUFvQjtBQUFBLFFBQ3BCLGNBQWM7QUFBQSxNQUNoQixDQUFDO0FBQUEsSUFDSDtBQUFBLEVBQ0Y7QUFJRjtBQUVPLFNBQVMsU0FBUyxTQUEyQztBQUNsRSxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPO0FBQUEsSUFDTCxRQUFRLFFBQVEsT0FBTztBQUFBLElBQ3ZCLFVBQVUsUUFBUSxPQUFPO0FBQUEsSUFDekIsaUJBQWlCLFFBQVEsT0FBTztBQUFBLElBQ2hDLFdBQVcsUUFBUSxPQUFPO0FBQUEsSUFDMUIsV0FBVyxRQUFRLE9BQU87QUFBQSxJQUMxQixNQUFNLFFBQVEsT0FBTztBQUFBLElBQ3JCLGVBQWUsUUFBUSxPQUFPO0FBQUEsRUFDaEM7QUFDRjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "updateGame"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["updateGameOnPlayers"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/updateGameOnPlayers/updateGameOnPlayers.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/updateGameOnPlayers/updateGameOnPlayers.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const timestamp = util.time.nowISO8601();
              context.stash.updatedAt = timestamp;
              const userIdItems = context.prev.result.items;
              const gameId = context.arguments.input.gameId;
              const updatePlayerOps = userIdItems.map((userIdItem) => ({
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixPlayer + "#" + userIdItem.userId
                }),
                table: "Wildsea-" + environment_default.name,
                update: {
                  expression: "SET #gameName = :gameName, #gameDescription = :gameDescription, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#gameName": "gameName",
                    "#gameDescription": "gameDescription",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":gameName": context.args.input.name,
                    ":gameDescription": context.arguments.input.description,
                    ":updatedAt": timestamp
                  })
                },
                operation: "UpdateItem"
              }));
              return {
                operation: "TransactWriteItems",
                transactItems: updatePlayerOps
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type);
              }
              return {};
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlR2FtZU9uUGxheWVycy50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIiwgIi4uLy4uL2xpYi9jb25zdGFudHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUE2Qzs7O0FDQXRELDRCQUFDLE1BQU8sVUFBUzs7O0FDS1YsSUFBTSxnQkFBZ0I7QUFFdEIsSUFBTSxrQkFBa0I7OztBRkd4QixTQUFTLFFBQVEsU0FBdUQ7QUFDN0UsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQWdEO0FBQUEsRUFDN0Q7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBbUM7QUFBQSxFQUNoRDtBQUVBLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUN2QyxVQUFRLE1BQU0sWUFBWTtBQUUxQixRQUFNLGNBQWMsUUFBUSxLQUFLLE9BQU87QUFDeEMsUUFBTSxTQUFTLFFBQVEsVUFBVSxNQUFNO0FBR3ZDLFFBQU0sa0JBQWtCLFlBQVksSUFBSSxDQUFDLGdCQUFnQjtBQUFBLElBQ3ZELEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxrQkFBa0IsTUFBTSxXQUFXO0FBQUEsSUFDekMsQ0FBQztBQUFBLElBQ0QsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixhQUFhO0FBQUEsUUFDYixvQkFBb0I7QUFBQSxRQUNwQixjQUFjO0FBQUEsTUFDaEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLGFBQWEsUUFBUSxLQUFLLE1BQU07QUFBQSxRQUNoQyxvQkFBb0IsUUFBUSxVQUFVLE1BQU07QUFBQSxRQUM1QyxjQUFjO0FBQUEsTUFDaEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxFQUNiLEVBQUU7QUFFRixTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxlQUFlO0FBQUEsRUFDakI7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUF5QjtBQUNoRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLElBQUk7QUFBQSxFQUN0RDtBQUVBLFNBQU8sQ0FBQztBQUNWOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "updateGameOnPlayers"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                   = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                 = "Wildsea-primary"
!~      schema               = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
          -     createGame(input: CreateGameInput!): Game! @aws_cognito_user_pools
          -     joinGame(input: JoinGameInput!): Game! @aws_cognito_user_pools
          +     createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools
          +     joinGame(input: JoinGameInput!): GameSummary! @aws_cognito_user_pools
          +     updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
          +     deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayerSheet(input: UpdatePlayerSheetInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
            }
            
            type Query {
          -     getGame(id: ID!): Game! @aws_cognito_user_pools
          +     getGame(input: GetGameInput): Game! @aws_cognito_user_pools
                getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayerSheet(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayerSheet", "deletePlayer"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
          +   updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "joinGame", "deleteGame"])
            }
            
          + input GetGameInput {
          +   gameId: ID!
          + }
          + 
            input CreateGameInput {
                name: String!
                description: String
            }
            
            input JoinGameInput {
              gameId: ID!
              joinToken: ID!
            }
            
          + input DeleteGameInput {
          +   gameId: ID!
          + }
          + 
          + input UpdateGameInput {
          +   gameId: ID!
          +   name: String!
          +   description: String
          + }
          + 
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
          + type GameSummary @aws_cognito_user_pools {
          +   gameId: ID!
          +   gameName: String!
          +   gameDescription: String
          +   fireflyUserId: String!
          +   createdAt: AWSDateTime!
          +   updatedAt: AWSDateTime!
          +   type: String!
          +   deleted: Boolean
          + }
          + 
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinToken: String
          +   fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
          +   deleted: Boolean
            }
            
            input UpdatePlayerSheetInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameDescription: String!
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              fireflyUserId: ID!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
        EOT
        tags                 = {
            "Name" = "Wildsea-primary"
        }
#        (9 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.pipeline["updateGame"] will be created
+   resource "aws_appsync_resolver" "pipeline" {
+       api_id            = "**************************"
+       arn               = (known after apply)
+       field             = "updateGame"
+       id                = (known after apply)
+       kind              = "PIPELINE"
+       request_template  = jsonencode({})
+       response_template = "$util.toJson($ctx.result)"
+       type              = "Mutation"

+       pipeline_config {
+           functions = (known after apply)
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["updatedGame"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // lib/constants.ts
            var TypeGame = "GAME";
            var DDBPrefixGame = "GAME";
            
            // lib/gameSubscription.ts
            import {
              util,
              extensions
            } from "@aws-appsync/utils";
            function subscriptionRequest(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              if (context.args.gameId == "") {
                util.error("Unauthorized: Game ID is missing.");
              }
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + context.args.gameId,
                  SK: DDBPrefixGame
                })
              };
            }
            function subscriptionResponse(context, objectTypes) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              if (!context.result || context.result.fireflyUserId !== identity.sub && !context.result.players?.includes(identity.sub)) {
                util.error("Unauthorized: User is not a player in this game.");
              }
              const filter = {
                gameId: { eq: context.args.gameId },
                type: { in: objectTypes }
              };
              extensions.setSubscriptionFilter(util.transform.toSubscriptionFilter(filter));
              return null;
            }
            
            // subscription/updatedGame/updatedGame.ts
            function request(context) {
              return subscriptionRequest(context);
            }
            function response(context) {
              const objectTypes = [TypeGame];
              return subscriptionResponse(context, objectTypes);
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiLi4vLi4vbGliL2NvbnN0YW50cy50cyIsICIuLi8uLi9saWIvZ2FtZVN1YnNjcmlwdGlvbi50cyIsICJ1cGRhdGVkR2FtZS50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBTyxJQUFNLFdBQVc7QUFLakIsSUFBTSxnQkFBZ0I7OztBQ0w3QjtBQUFBLEVBRUU7QUFBQSxFQUNBO0FBQUEsT0FHSztBQVlBLFNBQVMsb0JBQ2QsU0FDd0I7QUFDeEIsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLE1BQUksUUFBUSxLQUFLLFVBQVUsSUFBSTtBQUM3QixTQUFLLE1BQU0sbUNBQTZDO0FBQUEsRUFDMUQ7QUFFQSxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxRQUFRLEtBQUs7QUFBQSxNQUN2QyxJQUFJO0FBQUEsSUFDTixDQUFDO0FBQUEsRUFDSDtBQUNGO0FBRU8sU0FBUyxxQkFDZCxTQUNBLGFBQ0E7QUFDQSxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLEtBQUs7QUFDbEIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBR0EsTUFDRSxDQUFDLFFBQVEsVUFDUixRQUFRLE9BQU8sa0JBQWtCLFNBQVMsT0FDekMsQ0FBQyxRQUFRLE9BQU8sU0FBUyxTQUFTLFNBQVMsR0FBRyxHQUNoRDtBQUNBLFNBQUssTUFBTSxrREFBNEQ7QUFBQSxFQUN6RTtBQUVBLFFBQU0sU0FBUztBQUFBLElBQ2IsUUFBUSxFQUFFLElBQUksUUFBUSxLQUFLLE9BQU87QUFBQSxJQUNsQyxNQUFNLEVBQUUsSUFBSSxZQUFZO0FBQUEsRUFDMUI7QUFDQSxhQUFXLHNCQUFzQixLQUFLLFVBQVUscUJBQXFCLE1BQU0sQ0FBQztBQUU1RSxTQUFPO0FBQ1Q7OztBQ2pFTyxTQUFTLFFBQVEsU0FBc0I7QUFDNUMsU0FBTyxvQkFBb0IsT0FBTztBQUNwQztBQUVPLFNBQVMsU0FBUyxTQUFzQjtBQUM3QyxRQUFNLGNBQWMsQ0FBQyxRQUFRO0FBQzdCLFNBQU8scUJBQXFCLFNBQVMsV0FBVztBQUNsRDsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source = "Wildsea_primary"
+       field       = "updatedGame"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Subscription"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #383](https://github.com/jarrod-lowe/wildsea/actions/runs/11302056308)